[
    "   Welcome to explorer-cli!                                                   ",
    "                                                                              ",
    "   explorer-cli is a utility for examining JSON data structures               ",
    "   from any source.                                                           ",
    "                                                                              ",
    "   The user configures the sources of data and can then load the              ",
    "   data as required in order to explore it.                                   ",
    "                                                                              ",
    "   The tool is similar to Postman in that the user configures the             ",
    "   requests for data and maintains a record of the main requests              ",
    "   and similar to Vim in that all operations are performed via a              ",
    "   keystroke to allow workflows to become habitual.                           ",
    "                                                                              ",
    "   The entire state of the application can be easily serialised into          ",
    "   a json output file and loaded again when the application restarts.         ",
    "                                                                              ",
    "                                                                              ",
    "                                                                              ",
    "   Usage:                                                                     ",
    "                                                                              ",
    "      explorer-cli                                                            ",
    "                                                                              ",
    "                      This starts the application with this help text         ",
    "                      loaded as the default data                              ",
    "                                                                              ",
    "      explorer-cli {filename}                                                 ",
    "                                                                              ",
    "                      This starts the application using {filename} as the     ",
    "                      file to autosave state into. If the file already exists ",
    "                      then the state saved in the file is loaded on start.    ",
    "                                                                              ",
    "                                                                              ",
    "   Movement (including on this screen):                                       ",
    "                                                                              ",
    "       'Ctrl-d': move screen down half a screen                               ",
    "       'Ctrl-u': move screen up half a screen                                 ",
    "       'j'     : move screen down one line                                    ",
    "       'k'     : move screen up one line                                      ",
    "                                                                              ",
    "                                                                              ",
    "   Quick Start (from this screen):                                            ",
    "                                                                              ",
    "       1. Run 'npm install -g explorer-cli explorer-cli-http' to install      ",
    "       2. Press 'l' to load a cache of data (a few are configured by default) ",
    "       3. Enter 'http' and press return (to load the http template)           ",
    "       4. Press 'Shift-R' to run the loaded template                          ",
    "                                                                              ",
    "       These 4 steps will make an HTTP request to the Github API to show the  ",
    "       rate limits available from the current computer. It then allows the    ",
    "       user to review the response object.                                    ",
    "                                                                              ",
    "                                                                              ",
    "   Keys:                                                                      ",
    "                                                                              ",
    "       'Ctrl-c' : quit the application                                        ",
    "       'q'      : quit the application                                        ",
    "       'q'      : quit the application                                        ",
    "       'Ctrl-d' : move screen down half a screen                              ",
    "       'Ctrl-u' : move screen up half a screen                                ",
    "       'j'      : move screen down one line                                   ",
    "       'k'      : move screen up one line                                     ",
    "       'Shift-K': show (toggle) top level keys in the current data set        ",
    "       'h'      : show (toggle) this help screen (when there is other data)   ",
    "       's'      : show (toggle) the settings view                             ",
    "       'c'      : clear all settings to initial                               ",
    "       'u'      : move up one node in the tree                                ",
    "       'p'      : set the current node by path (e.g. body.list.0.title)       ",
    "       'm'      : set the current field to pull out of an object array at the ",
    "                  current node                                                ",
    "       'r'      : set the current node by relative path                       ",
    "                  .. moves up a directory, anything else is added to path     ",
    "                  so if current path is body.list, entering 0.title will set  ",
    "                  the path to body.list.0.title                               ",
    "       'x'      : select the currently visible fields (comma separated)       ",
    "       'o'      : select the currently hidden fields (comma separated)        ",
    "       'Shift-S': save the current state to a file and turn on autosave       ",
    "       't'      : set the value at the current node (JSON input)              ",
    "       'Shift-D': delete the current node                                     ",
    "       'a'      : add the current data to a named buffer.                     ",
    "                  This is possible with any data, but is particularly useful  ",
    "                  for templates that specify a request for data               ",
    "       'l'      : load the data from a named buffer                           ",
    "       'A'      : delete the data in a named buffer                           ",
    "       'Shift-C': show a list of named buffers                                ",
    "       'Shift-R': attempt to run the current data using the given 'runType'   ",
    "                  property (does nothing if run type does not exist or is     ",
    "                  not installed)                                              ",
    "       'Shift-Z': toggle autosave                                             ",
    "                                                                              ",
    "                                                                              ",
    "   Run Types:                                                                 ",
    "                                                                              ",
    "       If the 'runType' property exists in the data, pressing Shift-R will    ",
    "       cause explorer-cli to attempt to transform the data by applying an     ",
    "       asynchronous transformation function to the data.                      ",
    "                                                                              ",
    "       Run Types are packaged as node-style callback functions with the       ",
    "       signature `function (data, cb)`                                        ",
    "                                                                              ",
    "       The callback function is called with `cb(err, res)`                    ",
    "       where 'err' is a serializable error object or null and 'res' is the    ",
    "       result of the transformation.                                          ",
    "                                                                              ",
    "       e.g.                                                                   ",
    "                                                                              ",
    "       if the 'http' run type is installed and the data is:                   ", 
    "         {                                                                    ",
    "           'runType': 'http',                                                 ",
    "           'url': 'http://some.host/some/path'                                ",
    "         }                                                                    ",
    "       then Shift-R will cause the data to be replaced with the result of     ",
    "       making the HTTP request                                                "
]